In [1]:
a = {'이름' : ['홍길동', '사람 1', '사람 2'], '나이' : [20, 30, 25], '도시' :['서울', '서울', '대전']}

In [2]:
import pandas as pd
df = pd.DataFrame(a)

In [3]:
df

     이름  나이  도시
0   홍길동  20  서울
1  사람 1  30  서울
2  사람 2  25  대전

In [4]:
df2 = df.set_index('이름')

In [5]:
df2

      나이  도시
이름
홍길동   20  서울
사람 1  30  서울
사람 2  25  대전

In [6]:
df3 = df2.set_index('도시') # 기존 인덱스는 사라졌네??

In [7]:
df3

    나이
도시
서울  20
서울  30
대전  25

In [8]:
df2

      나이  도시
이름
홍길동   20  서울
사람 1  30  서울
사람 2  25  대전

In [9]:
df3 = df2.reset_index()

In [10]:
df3

     이름  나이  도시
0   홍길동  20  서울
1  사람 1  30  서울
2  사람 2  25  대전

In [13]:
df3 = df.set_index('도시')

In [14]:
df3

      이름  나이
도시
서울   홍길동  20
서울  사람 1  30
대전  사람 2  25

In [15]:
df2

      나이  도시
이름
홍길동   20  서울
사람 1  30  서울
사람 2  25  대전

In [18]:
df2 = df2.sort_index(ascending = True)

In [19]:
df2

      나이  도시
이름
사람 1  30  서울
사람 2  25  대전
홍길동   20  서울

In [20]:
df2 = df2.sort_index(ascending = False)

In [21]:
df2

      나이  도시
이름
홍길동   20  서울
사람 2  25  대전
사람 1  30  서울

In [22]:
df2 = df2.sort_values(by = '나이', ascending = True)

In [23]:
df2

      나이  도시
이름
홍길동   20  서울
사람 2  25  대전
사람 1  30  서울

In [24]:
df2 = df2.sort_values(by = '나이', ascending = False)

In [25]:
df2

      나이  도시
이름
사람 1  30  서울
사람 2  25  대전
홍길동   20  서울

In [26]:
df2 = df2.T

In [27]:
df2

이름 사람 1 사람 2 홍길동
나이   30   25  20
도시   서울   대전  서울

In [28]:
df2 = df2.T

In [29]:
df2

      나이  도시
이름
사람 1  30  서울
사람 2  25  대전
홍길동   20  서울

In [30]:
df2['나이대'] = ['30대', '20대', '20대']

In [31]:
df2

      나이  도시  나이대
이름
사람 1  30  서울  30대
사람 2  25  대전  20대
홍길동   20  서울  20대

In [32]:
df2 = df2.reset_index()

In [33]:
df2

     이름  나이  도시  나이대
0  사람 1  30  서울  30대
1  사람 2  25  대전  20대
2   홍길동  20  서울  20대

In [34]:
b = {'20대' : 2, '30대' : 3}

In [35]:
df2['나이대'] = df2['나이대'].map(b) ##

In [36]:
df2

     이름  나이  도시  나이대
0  사람 1  30  서울    3
1  사람 2  25  대전    2
2   홍길동  20  서울    2

In [37]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      3 non-null      object
 1   나이      3 non-null      object
 2   도시      3 non-null      object
 3   나이대     3 non-null      int64
dtypes: int64(1), object(3)
memory usage: 224.0+ bytes